; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v5 - type_1 ?v6 - type_2)
 	      (pred_4 ?v7 - object ?v6 - type_2)
	      (pred_3 ?v5 - type_1 ?v4 - type_3)
	      (pred_1 ?v5 - type_1 ?v7 - object ?v4 - type_3))

   (:action op_2
       :parameters  (?v5 - type_1 ?v2 ?v3 - type_2)
       :precondition (and  (pred_2 ?v5 ?v2))
       :effect (and  (pred_2 ?v5 ?v3)
		     (not (pred_2 ?v5 ?v2))))

   (:action op_3
       :parameters (?v5 - type_1 ?v8 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v1) (pred_2 ?v5 ?v1) (pred_3 ?v5 ?v4))
       :effect (and (pred_1 ?v5 ?v8 ?v4)
		    (not (pred_4 ?v8 ?v1)) 
		    (not (pred_3 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_1 ?v8 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v8 ?v4) (pred_2 ?v5 ?v1))
       :effect (and (pred_4 ?v8 ?v1)
		    (pred_3 ?v5 ?v4)
		    (not (pred_1 ?v5 ?v8 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_07 - type_1
obj_08 obj_05 obj_11 obj_09 - type_3
obj_04 obj_10 obj_03 - type_2
obj_06 obj_12 obj_01 - object)
(:init
(pred_2 obj_02 obj_03)
(pred_3 obj_02 obj_08)
(pred_3 obj_02 obj_05)
(pred_2 obj_07 obj_10)
(pred_3 obj_07 obj_11)
(pred_3 obj_07 obj_09)
(pred_4 obj_06 obj_04)
(pred_4 obj_12 obj_04)
(pred_4 obj_01 obj_04)
)
(:goal
(and
(pred_4 obj_06 obj_04)
(pred_4 obj_12 obj_10)
(pred_4 obj_01 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_02 obj_10) (pred_2 obj_07 obj_10))))
  )
)
)

; plan
1. (op_2 obj_02 obj_03 obj_04)
   deleted: (pred_2 obj_02 obj_03)
   added: (pred_2 obj_02 obj_04)
   goals met: 2 of 3
2. (op_2 obj_07 obj_10 obj_04)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_04)
   goals met: 2 of 3
3. (op_3 obj_02 obj_12 obj_04 obj_05)
   deleted: (pred_4 obj_12 obj_04) (pred_3 obj_02 obj_05)
   added: (pred_1 obj_02 obj_12 obj_05)
   goals met: 2 of 3
4. (op_2 obj_02 obj_04 obj_10)
   deleted: (pred_2 obj_02 obj_04)
   added: (pred_2 obj_02 obj_10)
   goals met: 2 of 3
5. (op_1 obj_02 obj_12 obj_10 obj_05)
   deleted: (pred_1 obj_02 obj_12 obj_05)
   added: (pred_4 obj_12 obj_10) (pred_3 obj_02 obj_05)
   goals met: 3 of 3
